//SHUTDWN JOB 'S322-0C4','WFJM',
//             USER=HERC01,PASSWORD=CUL8TR,
//             CLASS=${CLASS:-A},MSGCLASS=A,MSGLEVEL=(1,1),REGION=256K
//STOP     EXEC SHUTDOWN
//SYSPRINT DD SYSOUT=A
//SYSIN    DD *
