 /*      1         2         3         4         5         6         7*/--------
 /*4567890123456789012345678901234567890123456789012345678901234567890*/--------
  HELLO: PROC OPTIONS(MAIN) REORDER;
    PUT SKIP LIST('Hello World !');
  END HELLO;
