 /*      1         2         3         4         5         6         7*/--------
 /*4567890123456789012345678901234567890123456789012345678901234567890*/--------
 /* SPDX-License-Identifier: GPL-3.0-or-later                         */
 /* Copyright 2017-2019 by Walter F.J. Mueller <W.F.J.Mueller@gsi.de> */
 
  HELLO: PROC OPTIONS(MAIN) REORDER;
    PUT SKIP LIST('Hello World !');
  END HELLO;
