000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.     'HEWO'.
000300 ENVIRONMENT DIVISION.
001000 DATA DIVISION.
100000 PROCEDURE DIVISION.
100100 00-MAIN.
100500     DISPLAY 'Hello World !'.
100600     STOP RUN.
